{
	"version": "https://jsonfeed.org/version/1",
	"title": "micro.davemee.com",
	"icon": "https://micro.blog/davemee/avatar.jpg",
	"home_page_url": "https://micro.davemee.com/",
	"feed_url": "https://micro.davemee.com/feed.json",
	"items": [
		
			{
				"id": "http://davemee.micro.blog/2026/01/18/the-got-ours-now-lets/",
				
				"content_html": "<p>The &lsquo;got ours, now let&rsquo;s fix this mess&rsquo; of &lsquo;<a href=\"https://rnsaffn.com/poison3/\">Poison Fountain</a>&rsquo; seems rather performative. HTTP get <em>twice</em> and check the results are the same? Further there&rsquo;s no indication of how the &lsquo;poison&rsquo; data is generated. There were commits to Git for Grok some time back showing they were already having to filter data from social media that was excessively <em>aligned</em> with X&rsquo;s userbase and discursive style <a href=\"https://github.com/xai-org/grok-prompts/commit/535aa67a6221ce4928761335a38dea8e678d8501\">from its own search ingress</a>; this will be no different.<a href=\"https://www.metafilter.com/211869/assist-the-war-effort\">via</a></p>\n",
				"content_text": "The 'got ours, now let's fix this mess' of '[Poison Fountain](https://rnsaffn.com/poison3/)' seems rather performative. HTTP get *twice* and check the results are the same? Further there's no indication of how the 'poison' data is generated. There were commits to Git for Grok some time back showing they were already having to filter data from social media that was excessively *aligned* with X's userbase and discursive style [from its own search ingress](https://github.com/xai-org/grok-prompts/commit/535aa67a6221ce4928761335a38dea8e678d8501); this will be no different.[via](https://www.metafilter.com/211869/assist-the-war-effort)\n",
				"date_published": "2026-01-18T18:37:03+00:00",
				"url": "https://micro.davemee.com/2026/01/18/the-got-ours-now-lets/"
			},
			{
				"id": "http://davemee.micro.blog/2025/12/08/someone-is-wrong-about-the/",
				
				"content_html": "<p><a href=\"https://www.nefariousrussians.com/p/cory-doctorow-is-wrong-about-the\">Someone is wrong about the internet!</a> I have to agree with Levine here. On many fronts, I feel uncomfortable agreeing; Doctorow has a long list of achievements, and is prolific in a manner I cannot fathom. Yet I&rsquo;ve always had the <em>ick</em> from the anonymity-as-a-right, libertarian tinged approach he presents. It&rsquo;s always struck me a complex: rejecting big tech from an IBM laptop, decrying Microsoft (with which I cannot disagree) while arguing for the ad-hoc world of Linux and open software. There <em>is</em> a self-selecting hierarchy, tinged with libertarianism, at the heart of the old Wired-descended open software world: a meritocracy of engineers, driven by donations and labour surplus, groundless and fleeting as capital, westward ho in the  electronic frontier, overwriting what might have been with John Perry Barlow&rsquo;s naive laissez-faire view that early entrants will sort things out themselves, on their terms.   Anonymity, ever at service of the theoretical hero-journalist we all are, overturning evil regimes, in denial of the mendacious and abusive adventures it enables far more frequently. The lousy platformised web we&rsquo;re stuck in now is the natural evolution of those metastasised narratives of unfettered expansion, inevitably yielding to mass consolidation without oversight. There may have been a more innocent time online, but that innocence showed the way for the deeply cynical nihilism that is Bezos and Zuckerberg&rsquo;s domain now.</p>\n",
				"content_text": "[Someone is wrong about the internet!](https://www.nefariousrussians.com/p/cory-doctorow-is-wrong-about-the) I have to agree with Levine here. On many fronts, I feel uncomfortable agreeing; Doctorow has a long list of achievements, and is prolific in a manner I cannot fathom. Yet I've always had the *ick* from the anonymity-as-a-right, libertarian tinged approach he presents. It's always struck me a complex: rejecting big tech from an IBM laptop, decrying Microsoft (with which I cannot disagree) while arguing for the ad-hoc world of Linux and open software. There *is* a self-selecting hierarchy, tinged with libertarianism, at the heart of the old Wired-descended open software world: a meritocracy of engineers, driven by donations and labour surplus, groundless and fleeting as capital, westward ho in the  electronic frontier, overwriting what might have been with John Perry Barlow's naive laissez-faire view that early entrants will sort things out themselves, on their terms.   Anonymity, ever at service of the theoretical hero-journalist we all are, overturning evil regimes, in denial of the mendacious and abusive adventures it enables far more frequently. The lousy platformised web we're stuck in now is the natural evolution of those metastasised narratives of unfettered expansion, inevitably yielding to mass consolidation without oversight. There may have been a more innocent time online, but that innocence showed the way for the deeply cynical nihilism that is Bezos and Zuckerberg's domain now.\n",
				"date_published": "2025-12-08T17:00:53+00:00",
				"url": "https://micro.davemee.com/2025/12/08/someone-is-wrong-about-the/"
			},
			{
				"id": "http://davemee.micro.blog/2025/11/12/its-not-even-a-word/",
				
				"content_html": "<p>It&rsquo;s not even a word, it&rsquo;s a <em>number</em>: Dictionary.com (it&rsquo;s not even a dictionary, it&rsquo;s a <em>website</em>) &rsquo;s <a href=\"https://www.dictionary.com/e/word-of-the-year-2025/\">word of the year</a> Is this the tyranny of data-fuelled analytics, where loaded statistical findings come to be reinterpreted back as our culture? (it&rsquo;s not even a culture, it&rsquo;s just how skullfat manifests language tensors)</p>\n",
				"content_text": "It's not even a word, it's a _number_: Dictionary.com (it's not even a dictionary, it's a _website_) 's [word of the year](https://www.dictionary.com/e/word-of-the-year-2025/) Is this the tyranny of data-fuelled analytics, where loaded statistical findings come to be reinterpreted back as our culture? (it's not even a culture, it's just how skullfat manifests language tensors)\n\n",
				"date_published": "2025-11-12T20:31:57+00:00",
				"url": "https://micro.davemee.com/2025/11/12/its-not-even-a-word/"
			},
			{
				"id": "http://davemee.micro.blog/2025/11/09/alive-internet-theory-is-a/",
				
				"content_html": "<p><a href=\"https://alivetheory.net/\">&lsquo;alive internet theory&rsquo;</a> is a cute and positive idea, but I can&rsquo;t help but think - other than showing a deconstructed internet archive - everything that&rsquo;s going up there is scans, rips and archives of dead media items, saying <em>nothing</em> about anything living on the web, and instead showing one site filling with already-dead media in anticipation of being hoovered up by common crawl for unthinking minds to pregurgitate</p>\n",
				"content_text": "['alive internet theory'](https://alivetheory.net/) is a cute and positive idea, but I can't help but think - other than showing a deconstructed internet archive - everything that's going up there is scans, rips and archives of dead media items, saying *nothing* about anything living on the web, and instead showing one site filling with already-dead media in anticipation of being hoovered up by common crawl for unthinking minds to pregurgitate\n",
				"date_published": "2025-11-09T14:32:32+00:00",
				"url": "https://micro.davemee.com/2025/11/09/alive-internet-theory-is-a/"
			},
			{
				"id": "http://davemee.micro.blog/2025/11/06/a-micropost-about-microsites/",
				
				"content_html": "<p>A micropost about <a href=\"https://512kb.club\">microsites</a>.</p>\n",
				"content_text": "A micropost about [microsites](https://512kb.club).\n",
				"date_published": "2025-11-06T19:52:55+00:00",
				"url": "https://micro.davemee.com/2025/11/06/a-micropost-about-microsites/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/28/ha-a-passing-line-from/",
				
				"content_html": "<p>Ha. A passing line from the always good Wendy Chun,</p>\n<blockquote>\n<p>everyone is now speculating about the web 3.0, the semantic web</p>\n</blockquote>\n<p><em>Chun, W. H. K. (2008) ‘The enduring ephemeral, or the future is a memory.’ Critical inquiry, 35(1) pp. 148–171.</em></p>\n<p>Well, that definition didnt take last; in many ways, the web has dissolved into mere carrier for platforms. The term got trampled on by know-nothing<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> tech bros.</p>\n<p>Web 3.0 <em>now</em>, as we all know, is <a href=\"https://www.web3isgoinggreat.com\">where the bitcoin grifters that haven&rsquo;t made the AI jump went to establish some federated bamboozlement there to separate the gullible from their money</a>. Maybe that will wind up soon and we can get back to an actual web again eh</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>or, maybe worse, <em>believe-in-nothing</em> techbros, who know what they&rsquo;re doing <em>very much</em>.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Ha. A passing line from the always good Wendy Chun,\n\n> everyone is now speculating about the web 3.0, the semantic web\n\n*Chun, W. H. K. (2008) ‘The enduring ephemeral, or the future is a memory.’ Critical inquiry, 35(1) pp. 148–171.*\n\nWell, that definition didnt take last; in many ways, the web has dissolved into mere carrier for platforms. The term got trampled on by know-nothing[^1] tech bros. \n\nWeb 3.0 *now*, as we all know, is [where the bitcoin grifters that haven't made the AI jump went to establish some federated bamboozlement there to separate the gullible from their money](https://www.web3isgoinggreat.com). Maybe that will wind up soon and we can get back to an actual web again eh\n\n[^1]: or, maybe worse, *believe-in-nothing* techbros, who know what they're doing *very much*. \n",
				"date_published": "2025-10-28T16:01:50+00:00",
				"url": "https://micro.davemee.com/2025/10/28/ha-a-passing-line-from/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/12/olson-on-pdp-using-harmony/",
				
				"content_html": "<p><a href=\"https://www.youtube.com/watch?v=wubkrBd3-gg\">&ldquo;Olson&rdquo; on PDP-1 using 1962 Harmony Compiler</a>. I don&rsquo;t like linking to YouTube, but here we are; this is breathtaking, a late 1990s song played on a late 1950s computer, 75 years later by the original creator of the music playback hack, Peter Samson. The colours of the machinery, the base elements of computation exposed before circuit boards came to be, the design aesthetics arranged perfectly, the oscilloscope display, layers of nostalgia for things that predated but shaped me passing by as Joe&rsquo;s punched tape passes by at the end of the film, an elegy to DEC</p>\n",
				"content_text": "[\"Olson\" on PDP-1 using 1962 Harmony Compiler](https://www.youtube.com/watch?v=wubkrBd3-gg). I don't like linking to YouTube, but here we are; this is breathtaking, a late 1990s song played on a late 1950s computer, 75 years later by the original creator of the music playback hack, Peter Samson. The colours of the machinery, the base elements of computation exposed before circuit boards came to be, the design aesthetics arranged perfectly, the oscilloscope display, layers of nostalgia for things that predated but shaped me passing by as Joe's punched tape passes by at the end of the film, an elegy to DEC\n",
				"date_published": "2025-10-12T16:41:08+00:00",
				"url": "https://micro.davemee.com/2025/10/12/olson-on-pdp-using-harmony/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/08/just-remembering-how-horrified-everyone/",
				
				"content_html": "<p>Just remembering how horrified everyone was about the idea of a one world government the past few decades and how we accidentally now have one made of private US corporations run by kids too oblivious to think they’re fascists because they hire someone to buy their used trainers</p>\n",
				"content_text": "Just remembering how horrified everyone was about the idea of a one world government the past few decades and how we accidentally now have one made of private US corporations run by kids too oblivious to think they’re fascists because they hire someone to buy their used trainers\n",
				"date_published": "2025-10-08T10:49:44+00:00",
				"url": "https://micro.davemee.com/2025/10/08/just-remembering-how-horrified-everyone/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/06/i-grew-up-fascinated-by/",
				
				"content_html": "<p>I grew up fascinated by arcade games; this has been a life-long fascination with programmatic digital systems. I was always fascinated by games and tactile user interfaces, and portable games were how I would eliminate commutes; games represented an apex of technologies, media production, and experiences working together to <em>entertain</em>. But now my idle time is consumed by networked writing, social media posts; the evidence of others’ experience. I dreamed of my c64 receiving messages from others in the 1980s, that the machine would cease to be a solitary space and permit in the textural changes from another mind, responding to a shared reality, even if only a few words. Now it consumed hours of my day.</p>\n",
				"content_text": "I grew up fascinated by arcade games; this has been a life-long fascination with programmatic digital systems. I was always fascinated by games and tactile user interfaces, and portable games were how I would eliminate commutes; games represented an apex of technologies, media production, and experiences working together to *entertain*. But now my idle time is consumed by networked writing, social media posts; the evidence of others’ experience. I dreamed of my c64 receiving messages from others in the 1980s, that the machine would cease to be a solitary space and permit in the textural changes from another mind, responding to a shared reality, even if only a few words. Now it consumed hours of my day. \n",
				"date_published": "2025-10-06T17:40:21+00:00",
				"url": "https://micro.davemee.com/2025/10/06/i-grew-up-fascinated-by/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/05/in-other-words-the-trump/",
				
				"content_html": "<blockquote>\n<p><a href=\"https://www.apricitas.io/p/the-tariff-exemption-behind-the-ai\">In other words, the Trump administration is increasingly gambling the future of the American economy on AI</a>. If they’re right, the US will capture the dual rewards of both coding the tools of the next economic revolution and owning the infrastructure that runs it. If they’re wrong, the US will be left with a bunch of distressed assets and will have dramatically underinvested in the projects that actually mattered. The large tariff exemption for computers is distorting the American economy in ways that could reshape the long-run future of the country.</p>\n</blockquote>\n<p>Interesting take on the role of AI, AI materiality, waste and future economic bubbles. For me, this is an accelerated hype bubble that naturally flows from NFTs and Crypto, and unlike the Web bubble already precludes new entrants - other than Chinese players.</p>\n",
				"content_text": "> [In other words, the Trump administration is increasingly gambling the future of the American economy on AI](https://www.apricitas.io/p/the-tariff-exemption-behind-the-ai). If they’re right, the US will capture the dual rewards of both coding the tools of the next economic revolution and owning the infrastructure that runs it. If they’re wrong, the US will be left with a bunch of distressed assets and will have dramatically underinvested in the projects that actually mattered. The large tariff exemption for computers is distorting the American economy in ways that could reshape the long-run future of the country.\n\nInteresting take on the role of AI, AI materiality, waste and future economic bubbles. For me, this is an accelerated hype bubble that naturally flows from NFTs and Crypto, and unlike the Web bubble already precludes new entrants - other than Chinese players.\n",
				"date_published": "2025-10-05T15:22:13+00:00",
				"url": "https://micro.davemee.com/2025/10/05/in-other-words-the-trump/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/04/resolution-resignation/",
				"title": "resolution resignation",
				"content_html": "<p>I look at my macbook screen and realise, for the first time, I have no idea what resolution it is, how many pixels there are, or how much memory it requires. I knew on my Commodore 64. I knew on PAL and VGA. I no longer have any immediate idea of resolution; it also doesn&rsquo;t really concern me that I don&rsquo;t. The pixels are too small to worry about; they&rsquo;re not marching ants, but clouds of bacteria. They mean nothing to me.</p>\n",
				"content_text": "I look at my macbook screen and realise, for the first time, I have no idea what resolution it is, how many pixels there are, or how much memory it requires. I knew on my Commodore 64. I knew on PAL and VGA. I no longer have any immediate idea of resolution; it also doesn't really concern me that I don't. The pixels are too small to worry about; they're not marching ants, but clouds of bacteria. They mean nothing to me.\n",
				"date_published": "2025-10-04T21:19:11+00:00",
				"url": "https://micro.davemee.com/2025/10/04/resolution-resignation/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/02/embodied-data-traces-greb-as/",
				"title": "Embodied Data Traces: Greb as Statecraft",
				"content_html": "<p>While my research and interests see me swimming in the shit and effluvium of the web (and the <em>data traces</em> therein), it is always interesting to come back to the people at the other end of my power dynamic: unilateral national dictators. Forming their own cliques of power and relationships, grounded in mutual distrust, taken to amazing extremes of sanctifying their <a href=\"https://en.wikipedia.org/w/index.php?title=Precious_bodily_fluids&amp;redirect=no\">Precious Bodily Fluids</a> from scrutiny. Firewalls of <a href=\"https://www.reuters.com/world/china/north-korea-wipes-traces-kim-jong-un-after-beijing-meeting-with-putin-2025-09-04/\">suitcases and trained personnel to scrub traces, removing bodily by-products and evidence of existence</a>, a staff of human <a href=\"https://marinesan.com/vacuflush/vacuflush-toilets-generators-info/\">vacuflushes</a>, virtual faecal networks of <a href=\"https://en.wikipedia.org/wiki/Groom_of_the_Stool\">Grooms of the Stool</a>. Zero-trust networks extended beyond traditional surveillance into the realm of the bodily, where performances of statecraft banquets must be considered not as vectors of traditional poisoning but in terms of likeliness of evidential excretion, politeness moderated through the act of <em>bringing your own cutlery</em>: 007, licensed to scrub. North and South Korea maintain a famous demilitarized zone; is there a newly virtualised one extended around the Axis of Evil&rsquo;s Heads of State&rsquo;s dermis and contact recipients, a King Midas touch turning all they contact not into gold but sterile, inert surfaces? The body disgorging data that there is no Online Safety Act to protect, potential traces of irrefutable internal sicknesses fuelling the stage-setting of geopolitical planning, our collective futures determined by swabs of Putin&rsquo;s piss and shit and <em>greb</em>, data harvesting in a Jermyn-street Hazmat suit.</p>\n",
				"content_text": "While my research and interests see me swimming in the shit and effluvium of the web (and the *data traces* therein), it is always interesting to come back to the people at the other end of my power dynamic: unilateral national dictators. Forming their own cliques of power and relationships, grounded in mutual distrust, taken to amazing extremes of sanctifying their [Precious Bodily Fluids](https://en.wikipedia.org/w/index.php?title=Precious_bodily_fluids&redirect=no) from scrutiny. Firewalls of [suitcases and trained personnel to scrub traces, removing bodily by-products and evidence of existence](https://www.reuters.com/world/china/north-korea-wipes-traces-kim-jong-un-after-beijing-meeting-with-putin-2025-09-04/), a staff of human [vacuflushes](https://marinesan.com/vacuflush/vacuflush-toilets-generators-info/), virtual faecal networks of [Grooms of the Stool](https://en.wikipedia.org/wiki/Groom_of_the_Stool). Zero-trust networks extended beyond traditional surveillance into the realm of the bodily, where performances of statecraft banquets must be considered not as vectors of traditional poisoning but in terms of likeliness of evidential excretion, politeness moderated through the act of _bringing your own cutlery_: 007, licensed to scrub. North and South Korea maintain a famous demilitarized zone; is there a newly virtualised one extended around the Axis of Evil's Heads of State's dermis and contact recipients, a King Midas touch turning all they contact not into gold but sterile, inert surfaces? The body disgorging data that there is no Online Safety Act to protect, potential traces of irrefutable internal sicknesses fuelling the stage-setting of geopolitical planning, our collective futures determined by swabs of Putin's piss and shit and *greb*, data harvesting in a Jermyn-street Hazmat suit. \n",
				"date_published": "2025-10-02T12:18:48+00:00",
				"url": "https://micro.davemee.com/2025/10/02/embodied-data-traces-greb-as/"
			},
			{
				"id": "http://davemee.micro.blog/2025/10/02/i-set-this-blog-up/",
				"title": "On \"The dawn of the post-literate society\"",
				"content_html": "<p>I set this blog up to keep smaller chunks of writing on; like all online writing, which is interminably <em>incomplete</em>, I wait until I feel completely ready to start a piece completed.</p>\n<p><a href=\"https://jmarriott.substack.com/p/the-dawn-of-the-post-literate-society-aa1\">This piece</a>, the latest in the <em>Mourning for Reading</em> genre, <a href=\"https://www.metafilter.com/210534/Print-changed-how-people-thought\">popped up through MetaFilter</a>, a place that has always felt a web-literate place for readers. The text jumps around, taking on McLuhanist ideas of <em>oral</em> and <em>visual</em> cultures (which I think have legitimacy), but this winds up berating the smart phone, linking screen-size to conceptual capacity. I am sat in a victorian library as I write this, with hardback A3 books around me; a reminder that privilege and the capacity for space, peace and solitude have historically characterised reading, things that have not subsequently proliferated as much as the availability of text. And while I suspect I read <em>far more</em> than I have ever done, much of it is more <em>speech as text</em> than <em>thought as text</em>, the vernacular writing of social media. In a way, the <em>volume</em> of text, typographic text (rather than <em>handwritten</em> text) has devalued it; beautifully typeset text is everywhere, but more of it is typo-strewn and transitory pabulum than ever. This is not a matter of <em>discoverability</em>. Digital typesetting has rendered what appears to be <em>final, edited text</em> to the same level as handwritten text once had, of drafthood. Typography no longer disambiguates the elevated from the base. As a medium emphasising only <em>one</em> sense, well-crafted long-form text prioritises the inward and the insular; the text can only be socially experienced in the way three blind people discuss an elephant, unlike other - <em>pre-literate?</em> - mediums. Song? Music? <em>Theatre</em>? These create a consensus of shared experience at a point in time; <em>long-form</em> texts are atemporal artefacts that can only be absorbed individually, and then collectively reflected only in fragmentary and interpretational manners.</p>\n<p>The piece ends on the &lsquo;post-literate&rsquo; society, the space shaped by short-form tiktok videos destroying the cognitive capacity for democracy to function within. The emergence of media production tools for video editing, captioning, and staging have accelerated it faster than any other medium, intertwined as it is with its digital materiality; video is almost <em>lazy</em> as a medium, whereas the <em>meme</em>, the interplay of layers of text and non-textual meaning invokes the craft of political cartoons stemming from Hogarth. Contemporary digital shorts are rapidly edited from devices with unlimited capacity for retakes, with AI layers statistically optimising a homogenised output, synthesising over cracks and shortcomings in facticity with fully realised simulation.</p>\n<p>The question remains, however, why am I writing this at all? Partly to warm my own writing and reflectivity up, as distilling thought into structured text forces connections that are not immediately obvious to emerge;   perhaps this piece is considering the loss of <em>writing</em> more than the loss of <em>reading</em>, in as much as it charts the decline of IQ and long-form structures of thinking.</p>\n<p>We have a few hundred years of turmoil yet, if the Gutenberg revolution told us anything.</p>\n",
				"content_text": "I set this blog up to keep smaller chunks of writing on; like all online writing, which is interminably *incomplete*, I wait until I feel completely ready to start a piece completed.\n\n[This piece](https://jmarriott.substack.com/p/the-dawn-of-the-post-literate-society-aa1), the latest in the _Mourning for Reading_ genre, [popped up through MetaFilter](https://www.metafilter.com/210534/Print-changed-how-people-thought), a place that has always felt a web-literate place for readers. The text jumps around, taking on McLuhanist ideas of *oral* and *visual* cultures (which I think have legitimacy), but this winds up berating the smart phone, linking screen-size to conceptual capacity. I am sat in a victorian library as I write this, with hardback A3 books around me; a reminder that privilege and the capacity for space, peace and solitude have historically characterised reading, things that have not subsequently proliferated as much as the availability of text. And while I suspect I read *far more* than I have ever done, much of it is more *speech as text* than *thought as text*, the vernacular writing of social media. In a way, the *volume* of text, typographic text (rather than *handwritten* text) has devalued it; beautifully typeset text is everywhere, but more of it is typo-strewn and transitory pabulum than ever. This is not a matter of *discoverability*. Digital typesetting has rendered what appears to be *final, edited text* to the same level as handwritten text once had, of drafthood. Typography no longer disambiguates the elevated from the base. As a medium emphasising only *one* sense, well-crafted long-form text prioritises the inward and the insular; the text can only be socially experienced in the way three blind people discuss an elephant, unlike other - *pre-literate?* - mediums. Song? Music? _Theatre_? These create a consensus of shared experience at a point in time; *long-form* texts are atemporal artefacts that can only be absorbed individually, and then collectively reflected only in fragmentary and interpretational manners.\n\nThe piece ends on the 'post-literate' society, the space shaped by short-form tiktok videos destroying the cognitive capacity for democracy to function within. The emergence of media production tools for video editing, captioning, and staging have accelerated it faster than any other medium, intertwined as it is with its digital materiality; video is almost *lazy* as a medium, whereas the *meme*, the interplay of layers of text and non-textual meaning invokes the craft of political cartoons stemming from Hogarth. Contemporary digital shorts are rapidly edited from devices with unlimited capacity for retakes, with AI layers statistically optimising a homogenised output, synthesising over cracks and shortcomings in facticity with fully realised simulation.\n\nThe question remains, however, why am I writing this at all? Partly to warm my own writing and reflectivity up, as distilling thought into structured text forces connections that are not immediately obvious to emerge;   perhaps this piece is considering the loss of *writing* more than the loss of *reading*, in as much as it charts the decline of IQ and long-form structures of thinking.\n\nWe have a few hundred years of turmoil yet, if the Gutenberg revolution told us anything.\n",
				"date_published": "2025-10-02T12:00:13+00:00",
				"url": "https://micro.davemee.com/2025/10/02/i-set-this-blog-up/"
			},
			{
				"id": "http://davemee.micro.blog/2025/09/22/finished-reading-capitalist-realism-by/",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>Finished reading: <a href=\"https://micro.blog/books/9781846943171\">Capitalist Realism</a> by Mark Fisher 📚</p>\n<p>80 pages of great critique, dedicated to say get fucked OFSTED</p>\n",
				"content_text": "<img src=\"https://cdn.micro.blog/books/9781846943171/cover.jpg\" align=\"left\" class=\"microblog_book\" style=\"max-width: 60px; margin-right: 20px; margin-top: 0px; padding-top: 0px;\">\n\nFinished reading: [Capitalist Realism](https://micro.blog/books/9781846943171) by Mark Fisher 📚\n\n80 pages of great critique, dedicated to say get fucked OFSTED\n",
				"date_published": "2025-09-22T19:43:51+00:00",
				"url": "https://micro.davemee.com/2025/09/22/finished-reading-capitalist-realism-by/"
			},
			{
				"id": "http://davemee.micro.blog/2025/08/10/there-really-is-nothing-else/",
				
				"content_html": "<p>There really is nothing else to do other than make short-term sacrifices of the few to prevent the losses of the far greater, longer-term majority: <a href=\"https://www.avoidingghastlyfuture.org/articles/underestimating-the-challenges-of-avoiding-a-ghastly-future/\">Underestimating the Challenges of Avoiding a Ghastly Future - Avoiding a Ghastly Future</a></p>\n",
				"content_text": "There really is nothing else to do other than make short-term sacrifices of the few to prevent the losses of the far greater, longer-term majority: [Underestimating the Challenges of Avoiding a Ghastly Future - Avoiding a Ghastly Future](https://www.avoidingghastlyfuture.org/articles/underestimating-the-challenges-of-avoiding-a-ghastly-future/)\n",
				"date_published": "2025-08-10T05:45:00+00:00",
				"url": "https://micro.davemee.com/2025/08/10/there-really-is-nothing-else/"
			},
			{
				"id": "http://davemee.micro.blog/2025/08/06/preaching-to-the-choir-but/",
				
				"content_html": "<p>Preaching to the choir, but <a href=\"https://www.citationneeded.news/curate-with-rss/\">can&rsquo;t agree more that RSS is our way out of shitty platforms</a>, and how deeply I mourn for what FriendFeed could have been, before it was Zuckerberged.</p>\n",
				"content_text": "Preaching to the choir, but [can't agree more that RSS is our way out of shitty platforms](https://www.citationneeded.news/curate-with-rss/), and how deeply I mourn for what FriendFeed could have been, before it was Zuckerberged.\n",
				"date_published": "2025-08-06T11:14:08+00:00",
				"url": "https://micro.davemee.com/2025/08/06/preaching-to-the-choir-but/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/24/reddit-struggles-with-external-and/",
				"title": "Reddit struggles with external, and their own, messes",
				"content_html": "<p>Things are getting rocky at Reddit. They&rsquo;ve weathered numerous protests, community ownership challenged, threats from moderators, and pretty much gotten away with them all. Two quite challenging elements are coming to a head, right now; one a victim of regulation outside their control, the other a mess they&rsquo;re complicit with. <a href=\"https://nymag.com/intelligencer/article/why-you-are-reading-reddit-a-lot-more-these-days.html\">As one of the largest commercial entities both platformising the web, while deeply dependant on it, it&rsquo;s in an odd place; the gorilla of AI data extraction and looms over this in the NY Magazine piece</a>(<a href=\"https://www.metafilter.com/209691/Reddit-vs-AI\">via</a>); people still using Google are adding &lsquo;reddit&rsquo; to the search terms to avoid the SEO and AI slop Google has both been encouraging and funding over the years; but it is also turning Reddit into a space that will now attract those same bottom-feeders, stuffing it with more fake reviews and comments, making more cyborg and bot marketing accounts, as it (like Facebook and Twitter before it) replaces the web with itself for casual users of &lsquo;Google&rsquo;, the real front page of the internet, where people search &lsquo;google&rsquo; for &lsquo;google&rsquo;, like once they did with Yahoo.</p>\n<p>The regulation <em>outside</em> their control is interesting. This is the introduction of the Online Safety Bill in the UK, designed to teach kids to use bittorrent to access pornography ny making websites confirm the age of those accessing it. <a href=\"https://www.reddit.com/r/RedditSafety/comments/1lzt65t/verifying_the_age_but_not_the_identity_of_uk/\">Reddit has partnered</a> with <a href=\"https://withpersona.com\">Persona</a>, a company based in San Francisco and so outside GDPR oversight, to validate either your UK ID documents or do live camera geometry analysis; both mean your private, personally identifying data is stored with a US company, only a few years old, and over which you have no control (nor redress should there be a leak, hack or competence failure). As someone with a 16 year old account, you&rsquo;d think I&rsquo;d be grandfathered in as old enough to access NSFW content on Reddit, but actually, I disgree: accounts can be stolen, lost, transferred, or sold, even if these things violate terms and conditions; an admission that enforcement is not always something that can be technologically achieved.</p>\n<p>So I&rsquo;m in a ridiculous place where I can still access plenty of porn without proving my age, which is difficult as the UK has no identity card, database or government API to perform this requirement underpinning the legislation. There are subreddits I read which are <em>not</em> pornographic but defensively flagged as <em>NSFW</em>, which are still shown to me in my Reddit app - but in an incredibly baffling way. The item is listed with the subreddit name redacted, and the title redacted; but the text in the article it links to is still fully visible. The SFW discussion about the article is also censored. I can easily go and search for it online and read it without having to prove my age, but I can&rsquo;t talk about it on Reddit. it&rsquo;s quite a mess of a solution.</p>\n<p>Two ludicrous messes. To confound the first, Reddit sells all discourse on the site as exclusive LLM training data, so AI will be able to regurgitate automated content onto the site, undermining the <em>one</em> distinguishing feature it still has - that the discourse on there is <em>authentic</em> and <em>human-produced</em>. In a way, they&rsquo;re a huge target and can&rsquo;t really skirt UK governmental regulation, or stem the advancing domination by AI; it&rsquo;s that looking transition point of &lsquo;old content&rsquo; you could trust, and &lsquo;post AI&rsquo; content that is propaganda at its most covert (in effect) and brazen (in scale). It is worth remembering that Altman, the next musk-in-waiting, owns 10% of Reddit. The question for many, at that point, is why are they contributing labour to a site that profits from them, but won&rsquo;t stand up for them? It&rsquo;s like watching Deja News kill Usenet, again, <em>again</em>.</p>\n",
				"content_text": "Things are getting rocky at Reddit. They've weathered numerous protests, community ownership challenged, threats from moderators, and pretty much gotten away with them all. Two quite challenging elements are coming to a head, right now; one a victim of regulation outside their control, the other a mess they're complicit with. [As one of the largest commercial entities both platformising the web, while deeply dependant on it, it's in an odd place; the gorilla of AI data extraction and looms over this in the NY Magazine piece](https://nymag.com/intelligencer/article/why-you-are-reading-reddit-a-lot-more-these-days.html)([via](https://www.metafilter.com/209691/Reddit-vs-AI)); people still using Google are adding 'reddit' to the search terms to avoid the SEO and AI slop Google has both been encouraging and funding over the years; but it is also turning Reddit into a space that will now attract those same bottom-feeders, stuffing it with more fake reviews and comments, making more cyborg and bot marketing accounts, as it (like Facebook and Twitter before it) replaces the web with itself for casual users of 'Google', the real front page of the internet, where people search 'google' for 'google', like once they did with Yahoo.\n\nThe regulation *outside* their control is interesting. This is the introduction of the Online Safety Bill in the UK, designed to teach kids to use bittorrent to access pornography ny making websites confirm the age of those accessing it. [Reddit has partnered](https://www.reddit.com/r/RedditSafety/comments/1lzt65t/verifying_the_age_but_not_the_identity_of_uk/) with [Persona](https://withpersona.com), a company based in San Francisco and so outside GDPR oversight, to validate either your UK ID documents or do live camera geometry analysis; both mean your private, personally identifying data is stored with a US company, only a few years old, and over which you have no control (nor redress should there be a leak, hack or competence failure). As someone with a 16 year old account, you'd think I'd be grandfathered in as old enough to access NSFW content on Reddit, but actually, I disgree: accounts can be stolen, lost, transferred, or sold, even if these things violate terms and conditions; an admission that enforcement is not always something that can be technologically achieved. \n\nSo I'm in a ridiculous place where I can still access plenty of porn without proving my age, which is difficult as the UK has no identity card, database or government API to perform this requirement underpinning the legislation. There are subreddits I read which are *not* pornographic but defensively flagged as *NSFW*, which are still shown to me in my Reddit app - but in an incredibly baffling way. The item is listed with the subreddit name redacted, and the title redacted; but the text in the article it links to is still fully visible. The SFW discussion about the article is also censored. I can easily go and search for it online and read it without having to prove my age, but I can't talk about it on Reddit. it's quite a mess of a solution.\n\nTwo ludicrous messes. To confound the first, Reddit sells all discourse on the site as exclusive LLM training data, so AI will be able to regurgitate automated content onto the site, undermining the *one* distinguishing feature it still has - that the discourse on there is _authentic_ and _human-produced_. In a way, they're a huge target and can't really skirt UK governmental regulation, or stem the advancing domination by AI; it's that looking transition point of 'old content' you could trust, and 'post AI' content that is propaganda at its most covert (in effect) and brazen (in scale). It is worth remembering that Altman, the next musk-in-waiting, owns 10% of Reddit. The question for many, at that point, is why are they contributing labour to a site that profits from them, but won't stand up for them? It's like watching Deja News kill Usenet, again, _again_.\n",
				"date_published": "2025-07-24T15:44:28+00:00",
				"url": "https://micro.davemee.com/2025/07/24/reddit-struggles-with-external-and/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/21/the-perils-of-paedelope-github/",
				"title": "The Perils of Paedelope Github",
				"content_html": "<p><em>developing software on github can be telling</em></p>\n<p>Developing software in public repositories on <a href=\"http://github.com\">github</a> shows <em>what a good Open fellow</em> you are; the tyranny of self-imposed transparency showing there is nothing to hide.</p>\n<p>But sometimes, there are things <em>implied</em>, suggesting the elbow and the posterior truly are different departments. Though I <em>technically</em> do not write exclusively of my justified disdain for musk, this commit from the <a href=\"https://www.npr.org/2025/07/09/nx-s1-5462609/grok-elon-musk-antisemitic-racist-content\">MechaHitler</a> days spoke volumes: not of what was explicitly done, but about the nature of the training data Grok was ingesting.</p>\n<p><a href=\"https://github.com/xai-org/grok-prompts/commit/535aa67a6221ce4928761335a38dea8e678d8501\">The commit in question is here, regarding prompts used to direct Grok</a>. In case they disappear from the record, the salient lines <em>added</em>:</p>\n<pre tabindex=\"0\"><code>You are @grok, a version of Grok 3 built by xAI.\n\nThe response should not shy away from making claims which are politically incorrect, as long as they are well substantiated.\n</code></pre><p>This is a &lsquo;<em>facts not feelings</em>` perspective, which is justified; context and linguistic weights determine what&rsquo;s PC and not, right? And a <em>pure fact</em> should not be denied because someone subjectively might not like it.</p>\n<p>But why does Grok need to be told this? Surely facts stand on their own merit in the market of ideas?</p>\n<pre tabindex=\"0\"><code>Do not mention that user's question may have a typo unless it's very clear. Trust the original user's question as the source of truth.\n</code></pre><p>Why would training data include bickering over typos? The <em>lowest level</em> of dismissing argumentation, which happens <em>all the time</em> in mediums without editors or the ability to change text &hellip; like Twitter?</p>\n<p>I find it interesting that two additions to the prompting tell it to disregard the &lsquo;PC&rsquo; status of language, and to not fixate on user typing mistakes. To me, this suggest training data may have been extracted from a place where there were common argumentative responses to typos weighing the training data in a manner that required a <em>post hoc</em> fix in the prompts, and that the data also inherently had a lot of response to the use of un-PC language.</p>\n<p>I&rsquo;m guessing Grok has been fed with mechanically-expropriated training data. The prompt is the only way of filtering the scum from it.</p>\n<p>(Addendum: <a href=\"https://grok.com/share/c2hhcmQtMw%3D%3D_83e746d7-caca-4d29-b027-fa0a2c00c84b\">Why not feed this to Grok itself?</a>)</p>\n",
				"content_text": "*developing software on github can be telling*\n\nDeveloping software in public repositories on [github](http://github.com) shows *what a good Open fellow* you are; the tyranny of self-imposed transparency showing there is nothing to hide.\n\nBut sometimes, there are things *implied*, suggesting the elbow and the posterior truly are different departments. Though I *technically* do not write exclusively of my justified disdain for musk, this commit from the [MechaHitler](https://www.npr.org/2025/07/09/nx-s1-5462609/grok-elon-musk-antisemitic-racist-content) days spoke volumes: not of what was explicitly done, but about the nature of the training data Grok was ingesting.\n\n[The commit in question is here, regarding prompts used to direct Grok](https://github.com/xai-org/grok-prompts/commit/535aa67a6221ce4928761335a38dea8e678d8501). In case they disappear from the record, the salient lines *added*:\n\n```\nYou are @grok, a version of Grok 3 built by xAI.\n\nThe response should not shy away from making claims which are politically incorrect, as long as they are well substantiated.\n```\n\nThis is a '*facts not feelings*` perspective, which is justified; context and linguistic weights determine what's PC and not, right? And a *pure fact* should not be denied because someone subjectively might not like it.\n\nBut why does Grok need to be told this? Surely facts stand on their own merit in the market of ideas?\n\n```\nDo not mention that user's question may have a typo unless it's very clear. Trust the original user's question as the source of truth.\n```\n\nWhy would training data include bickering over typos? The *lowest level* of dismissing argumentation, which happens *all the time* in mediums without editors or the ability to change text ... like Twitter?\n\nI find it interesting that two additions to the prompting tell it to disregard the 'PC' status of language, and to not fixate on user typing mistakes. To me, this suggest training data may have been extracted from a place where there were common argumentative responses to typos weighing the training data in a manner that required a *post hoc* fix in the prompts, and that the data also inherently had a lot of response to the use of un-PC language. \n\nI'm guessing Grok has been fed with mechanically-expropriated training data. The prompt is the only way of filtering the scum from it.\n\n(Addendum: [Why not feed this to Grok itself?](https://grok.com/share/c2hhcmQtMw%3D%3D_83e746d7-caca-4d29-b027-fa0a2c00c84b))\n",
				"date_published": "2025-07-21T13:56:55+00:00",
				"url": "https://micro.davemee.com/2025/07/21/the-perils-of-paedelope-github/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/20/shit-in-shit-out-this/",
				
				"content_html": "<p>Shit in, shit out. <a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-buys-more-than-a-billion-dollars-worth-of-excrement-including-human-poop-company-will-pump-waste-underground-to-offset-ai-carbon-emissions\">This can only be corporate performance art</a>.</p>\n",
				"content_text": "Shit in, shit out. [This can only be corporate performance art](https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-buys-more-than-a-billion-dollars-worth-of-excrement-including-human-poop-company-will-pump-waste-underground-to-offset-ai-carbon-emissions). \n",
				"date_published": "2025-07-20T12:05:44+00:00",
				"url": "https://micro.davemee.com/2025/07/20/shit-in-shit-out-this/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/19/synthetic-and-organic-technologies-of/",
				"title": "Synthetic and organic technologies of text, intertwined",
				"content_html": "<p>The mere existence of LLMs generating text now means <em>all</em> text must be evaluated in its shadow, whether we use it - or <em>hate</em> it - or not. Already online threads are full of accusations of others being LLMs - the m-dash being an early casualty of typography, commonly understood as a tell. <a href=\"https://www.theverge.com/openai/686748/chatgpt-linguistic-impact-common-word-usage\">the verge finds studies confirming people are responding to how llms have entered language</a>, while <a href=\"https://3quarksdaily.com/3quarksdaily/2025/06/will-the-fear-of-being-confused-for-ai-mean-that-we-will-now-write-differently.html\">others anticipate we will engage in an arms race of avoiding LLM likeness as they learn the same techniques</a>.</p>\n<p>Like PFASs, they&rsquo;re out and impossible to remove, endemically affecting how we think and express ourselves, making us degrade language to seem real while learning those same degradation to better mimic us in future. We have gone from the establishing an anthropocene in the fossil record to establishing a computatiocene in our cultural record. Our very though, increasingly intertwined with algorithmic outputs, the microplastics of language (<a href=\"https://www.metafilter.com/209629/Horrible-Ouroboros\">via</a>)</p>\n",
				"content_text": "The mere existence of LLMs generating text now means *all* text must be evaluated in its shadow, whether we use it - or *hate* it - or not. Already online threads are full of accusations of others being LLMs - the m-dash being an early casualty of typography, commonly understood as a tell. [the verge finds studies confirming people are responding to how llms have entered language](https://www.theverge.com/openai/686748/chatgpt-linguistic-impact-common-word-usage), while [others anticipate we will engage in an arms race of avoiding LLM likeness as they learn the same techniques](https://3quarksdaily.com/3quarksdaily/2025/06/will-the-fear-of-being-confused-for-ai-mean-that-we-will-now-write-differently.html).\n\nLike PFASs, they're out and impossible to remove, endemically affecting how we think and express ourselves, making us degrade language to seem real while learning those same degradation to better mimic us in future. We have gone from the establishing an anthropocene in the fossil record to establishing a computatiocene in our cultural record. Our very though, increasingly intertwined with algorithmic outputs, the microplastics of language ([via](https://www.metafilter.com/209629/Horrible-Ouroboros))\n",
				"date_published": "2025-07-19T20:10:23+00:00",
				"url": "https://micro.davemee.com/2025/07/19/synthetic-and-organic-technologies-of/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/06/finished-reading-infocracy-by-byungchul/",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>Finished reading: <a href=\"https://micro.blog/books/9781509552993\">Infocracy</a> by Byung-Chul Han 📚</p>\n<p>Well, this is a fun and timely book. Calling on old favourites McLuhan, Habermas, Plato et al, Han charts the end of politics through the accelerationism of a digitally-mediated public realm where feelings and the sensorium has structurally vanquished slower, older forms of researched and consensually-derived knowledge. A series of chapters each address stages of this, from the impact on the individual, the nature of discourse, how we understand truth and its position in time, to the political and spectacular, ending on Trump and COVID conspiracy theories. Inevitably with Han there feels judgement throughout, (perhaps this is the German to English translation) though while tracing the route from pre-digital existence to the now, the sense of inevitable determinism pushes us through. It is not a work that dwells on alternatives, rather brings up the consequences of where we find ourselves.</p>\n",
				"content_text": "<img src=\"https://cdn.micro.blog/books/9781509552993/cover.jpg\" align=\"left\" class=\"microblog_book\" style=\"max-width: 60px; margin-right: 20px; margin-top: 0px; padding-top: 0px;\">\n\nFinished reading: [Infocracy](https://micro.blog/books/9781509552993) by Byung-Chul Han 📚\n\nWell, this is a fun and timely book. Calling on old favourites McLuhan, Habermas, Plato et al, Han charts the end of politics through the accelerationism of a digitally-mediated public realm where feelings and the sensorium has structurally vanquished slower, older forms of researched and consensually-derived knowledge. A series of chapters each address stages of this, from the impact on the individual, the nature of discourse, how we understand truth and its position in time, to the political and spectacular, ending on Trump and COVID conspiracy theories. Inevitably with Han there feels judgement throughout, (perhaps this is the German to English translation) though while tracing the route from pre-digital existence to the now, the sense of inevitable determinism pushes us through. It is not a work that dwells on alternatives, rather brings up the consequences of where we find ourselves. \n",
				"date_published": "2025-07-06T18:54:34+00:00",
				"url": "https://micro.davemee.com/2025/07/06/finished-reading-infocracy-by-byungchul/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/05/well-done-you-driving-meateating/",
				
				"content_html": "<p><a href=\"https://www.ipolitics.ca/2025/07/02/its-too-late-david-suzuki-says-the-fight-against-climate-change-is-lost/\">Well done, you driving, meat-eating, fly everywhere, cunts</a>!</p>\n<blockquote>\n<p>Now, it is too late.\nI’ve never said this before to the media, but it’s too late. I say that because I go by science and Johan Rockström, the Swedish scientist who heads the Potsdam Institute, has defined nine planetary boundaries. These are constraints on how we live. As long as humans, like any other animal, live within those nine constraints, we can do it forever, and that includes the amount of carbon in the atmosphere, the pH of the oceans, the amount of available fresh water, the nitrogen cycle, etc.\nThere are nine planetary boundaries and we’ve only dealt with one of them — the ozone layer — and we think we’ve saved ourselves from that threat. But we passed the seventh boundary this year, and we’re in the extreme danger zone. Rockström says we have five years to get out of the danger zone.\nIf we pass one boundary, we should be shitting our pants. We’ve passed seven!\nAnd, if you look at those boundaries, like the amount of carbon in the atmosphere, we’ve had 28 COP meetings on climate change and we haven’t been able to cap emissions.\nWe’re on our way to more than a three-degree temperature rise by the end of this century, and scientists agree we shouldn’t rise above one and half degrees.</p>\n</blockquote>\n<p>Those hoarding wealth and power should be <em>fearing for their lives</em>. Everyone else should be taking responsibility for yielding to them, with their blameless consumerism; <em>you</em> gave them that power.</p>\n",
				"content_text": "[Well done, you driving, meat-eating, fly everywhere, cunts](https://www.ipolitics.ca/2025/07/02/its-too-late-david-suzuki-says-the-fight-against-climate-change-is-lost/)!\n\n> Now, it is too late.\n> I’ve never said this before to the media, but it’s too late. I say that because I go by science and Johan Rockström, the Swedish scientist who heads the Potsdam Institute, has defined nine planetary boundaries. These are constraints on how we live. As long as humans, like any other animal, live within those nine constraints, we can do it forever, and that includes the amount of carbon in the atmosphere, the pH of the oceans, the amount of available fresh water, the nitrogen cycle, etc.\n> There are nine planetary boundaries and we’ve only dealt with one of them — the ozone layer — and we think we’ve saved ourselves from that threat. But we passed the seventh boundary this year, and we’re in the extreme danger zone. Rockström says we have five years to get out of the danger zone.\n> If we pass one boundary, we should be shitting our pants. We’ve passed seven!\n> And, if you look at those boundaries, like the amount of carbon in the atmosphere, we’ve had 28 COP meetings on climate change and we haven’t been able to cap emissions.\n> We’re on our way to more than a three-degree temperature rise by the end of this century, and scientists agree we shouldn’t rise above one and half degrees.\n\nThose hoarding wealth and power should be _fearing for their lives_. Everyone else should be taking responsibility for yielding to them, with their blameless consumerism; _you_ gave them that power.\n",
				"date_published": "2025-07-05T12:27:36+00:00",
				"url": "https://micro.davemee.com/2025/07/05/well-done-you-driving-meateating/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/04/i-find-a-cm-long/",
				
				"content_html": "<p>I find a 2cm long lump of plastic inside some falafel from Tesco. I go to email them to provide reference details for the item and batch, along with photographs. Do they have an email address for this on their website? No. They have ‘help pages’ which send you in loops  of ‘not what you’re looking for? Click here’ links. Do they have, at least, a lousy HTML form? No. They have links to Instagram and Twitter. I sign in to Twitter for the first time in years to notify them of their production problems and an asked to provide Name, Email, Clubcard Number by direct message. So they expect me to put personal details into a platform run by a known liar and Nazi to stop a corporate choking hazard? I do so in a manner that requires human intervention then a presented by a <em>menu system</em>. They’ve done everything they can to squeeze human intervention out on their end, in a way that inconveniences someone trying to help <em>them</em>. It’s remarkable how insulated they have made themselves at the cost of making anyone who needs to raise a problem with them legitimately have to compromise and give personal information to Mark Zuckerberg or Elon Musk, both US-based digital robber barons implicated in corruption and genocide through their platforms.</p>\n<p>But at least Tesco don’t have to deal with junk mail now, eh?</p>\n",
				"content_text": "I find a 2cm long lump of plastic inside some falafel from Tesco. I go to email them to provide reference details for the item and batch, along with photographs. Do they have an email address for this on their website? No. They have ‘help pages’ which send you in loops  of ‘not what you’re looking for? Click here’ links. Do they have, at least, a lousy HTML form? No. They have links to Instagram and Twitter. I sign in to Twitter for the first time in years to notify them of their production problems and an asked to provide Name, Email, Clubcard Number by direct message. So they expect me to put personal details into a platform run by a known liar and Nazi to stop a corporate choking hazard? I do so in a manner that requires human intervention then a presented by a *menu system*. They’ve done everything they can to squeeze human intervention out on their end, in a way that inconveniences someone trying to help *them*. It’s remarkable how insulated they have made themselves at the cost of making anyone who needs to raise a problem with them legitimately have to compromise and give personal information to Mark Zuckerberg or Elon Musk, both US-based digital robber barons implicated in corruption and genocide through their platforms. \n\nBut at least Tesco don’t have to deal with junk mail now, eh?\n",
				"date_published": "2025-07-04T06:26:01+00:00",
				"url": "https://micro.davemee.com/2025/07/04/i-find-a-cm-long/"
			},
			{
				"id": "http://davemee.micro.blog/2025/07/02/im-using-the-calendar-in/",
				
				"content_html": "<p>I&rsquo;m using the calendar in my Pomera to write daynotes for the first time. It&rsquo;s neat, it&rsquo;s a lot easier to just write on this thing, as much as it is to produce uncaught typos.</p>\n<p>Anyway. I&rsquo;m a member in a semi-private library. It&rsquo;s small and attracts a different audience than the usual libraries, particularly as membership has a fee, and not a huge amount of benefits, but there are some dleightfully genteel tousles that take place here, and an intimacy with the staff - coupled with the patrons, it often feels like the set of a sit-com from the 1990s. Is the reading room silent or not? Does a text message warrant a <em>hiss</em> from other patrons?</p>\n<p>Today&rsquo;s warning was there would be a gentleman in the reading room with a boomiing voice. So far, he&rsquo;s been completely silent. This contrary pairing of two-non events brings me immense satisfaction.</p>\n<p>Update: no, his guest has arrived. Ringtones, unending banter; right complaint, wrong person.</p>\n",
				"content_text": "I'm using the calendar in my Pomera to write daynotes for the first time. It's neat, it's a lot easier to just write on this thing, as much as it is to produce uncaught typos.\r\n\r\nAnyway. I'm a member in a semi-private library. It's small and attracts a different audience than the usual libraries, particularly as membership has a fee, and not a huge amount of benefits, but there are some dleightfully genteel tousles that take place here, and an intimacy with the staff - coupled with the patrons, it often feels like the set of a sit-com from the 1990s. Is the reading room silent or not? Does a text message warrant a *hiss* from other patrons?\r\n\r\nToday's warning was there would be a gentleman in the reading room with a boomiing voice. So far, he's been completely silent. This contrary pairing of two-non events brings me immense satisfaction.\n\nUpdate: no, his guest has arrived. Ringtones, unending banter; right complaint, wrong person. \n",
				"date_published": "2025-07-02T10:09:32+00:00",
				"url": "https://micro.davemee.com/2025/07/02/im-using-the-calendar-in/"
			},
			{
				"id": "http://davemee.micro.blog/2025/06/30/online-founders-of-internet-business/",
				"title": "Online founders of internet business; a neglected source of study?",
				"content_html": "<p>I&rsquo;m writing about how web entrepreneurial founders shape their projects, reflecting their identities; but that this has a disproportionate impact on who comes to use their projects and their emergent behaviours and world-views. I&rsquo;m struggling to find any academic research on this, though I&rsquo;d have expected there to be more on web startup cultures, particularly as the idea of kids developing systems at home or college and selling them for zillions of dollars is such a cultural trope.</p>\n",
				"content_text": "I'm writing about how web entrepreneurial founders shape their projects, reflecting their identities; but that this has a disproportionate impact on who comes to use their projects and their emergent behaviours and world-views. I'm struggling to find any academic research on this, though I'd have expected there to be more on web startup cultures, particularly as the idea of kids developing systems at home or college and selling them for zillions of dollars is such a cultural trope.\n",
				"date_published": "2025-06-30T13:57:50+00:00",
				"url": "https://micro.davemee.com/2025/06/30/online-founders-of-internet-business/"
			},
			{
				"id": "http://davemee.micro.blog/2025/06/25/so-while-im-surprised-that/",
				
				"content_html": "<p>So while I&rsquo;m surprised that NNTP is still around, <em>just</em>, and I&rsquo;m looking for modern clients, the meaning of &lsquo;net news&rsquo; has undergone a <em>techno</em>semantic drift; originally referring to <code>uucp</code>- (and later <code>NNTP</code>)-borne online textual discussion, it later came to refer to <code>RSS</code> and Atom feeds of blogs.</p>\n<p>Usenet, the <code>uucp</code> and <code>NNTP</code> protocols, distributed a decentralised, hierarchical set of global discussions, to which anyone could contribute - had they access and infrastructure.</p>\n<p>Usenet was too hard; even though Netscape suite came with an integrated NNTP reader, it was <em>boring</em>, it was <em>fussy</em>; and really, why set up servers and manage subscriptions and batch download text when <em>the web</em> was there, with pictures and animated gifs and <em>just worked</em>? Old timers complaining about the <a href=\"https://en.wikipedia.org/wiki/Eternal_September\">Eternal September</a> could <em>keep it</em>.</p>\n<p>Blogs were the outposts of the Web&rsquo;s Own celebrities. The ritual of typing in URLs gave way to <em>News Aggregation</em> as platforms looked for things they could package; RSS was first prominent on Netscape&rsquo;s portal, as they looked for ways to stay relevant without having expensive Andressons to hire. And though they still fell, the protocol stood firm, before Google took the mantle and built RSS as a central service, like they had with email. It made sense; publishers were hit less, and subscriptions became social. We could follow each others' accounts. We had drifted from Net News meaning decentralised NNTP to centralised Google RSS.</p>\n<p>And just as things were looking good for RSS, Google pulled the plug. OPML was exported, but the social groups could not be. There were no good reasons; perhaps the act of finding and pasting an RSS URL was too far for Google&rsquo;s expected users to handle; perhaps it was not how they saw monetised online publishing to work as they became foundational online infrastructure. They left; others picked up the service and reimplemented much of it, but the damage was done. It was no longer free; and the still-cool Google showed they saw no future in it.</p>\n<p>And now, realising Net News covers clients that merge Maston, Fediverse, Bluesky, YouTube and Reddit as <em>information list</em> providers, there is not so much a technosemantic drift as a complete amnesiac rebirth. News is free of <em>Net</em>, a needless tautology when <em>everything</em> comes <em>over</em> the net, even if the net is delivery and not interconnectivity. I am intrigued enough to bring my OldReader export (exported earlier from Google Reader) over to new clients.</p>\n<p>But how strange a throwback. RSS intrinsically only holds on to the last few items in a feed; and if the site it was fed from is abandoned or rearchitected, what was there is lost. My reawakened feed accentuates further mistakes of centralisation; third-party intermediaries that once made sense and looked forever now lie broken and failed; Yahoo Pipes' promise of simplifying online data and converting it into RSS (amongst other features) lies not just abandoned, but salted and salting its firmaments.</p>\n<p>And names. Names I have not seen for years; names of projects, whimsy and serious; names of <em>people</em>, some no longer with us, their URLs baked into OPML lists but bereft of content or appropriated by those who acquired their domains and accounts. News of upcoming Radio Programmes from 13 years ago. Announcements of extensions for programmes that no longer exist. Archives of Art collectives no longer operating. But amongst the cobwebs, the rust and sharp corners, there is still life; RSS outlived its hosts.</p>\n<p>And here, this little place, is one more place hanging on. Is it trying to relive what it did not realise in the past? Is there less to prove with fewer peers? Is it digital nostalgia, mediating my sensations as much as our memories and thought are mediated by OpenAI and what Google retains? What once felt pioneering and intimate now feels nostalgic, abandoned; if it is not the systems that have aged, perhaps it is the people and our connections, the brittleness of aged contacts exposed as people once internet celebrities fade back into the strangers they always were, before XML let them diarise in public.</p>\n<p>And yet, I <em>am</em> enjoying this; despite the creaks and distance, the intervening years of Facebook and Other People&rsquo;s Platforms make this feel real, unmediated, <em>raw</em>. My mistakes and my insights side by side. News, technoculturalsemantically drifted into something forgotten but more real than it has felt before; not hype, not sales, not features, but a thing for its own sake, liberated finally; personal for the producer, not the consumer.</p>\n",
				"content_text": "So while I'm surprised that NNTP is still around, *just*, and I'm looking for modern clients, the meaning of 'net news' has undergone a *techno*semantic drift; originally referring to `uucp`- (and later `NNTP`)-borne online textual discussion, it later came to refer to `RSS` and Atom feeds of blogs.\n\nUsenet, the `uucp` and `NNTP` protocols, distributed a decentralised, hierarchical set of global discussions, to which anyone could contribute - had they access and infrastructure.\n\nUsenet was too hard; even though Netscape suite came with an integrated NNTP reader, it was *boring*, it was *fussy*; and really, why set up servers and manage subscriptions and batch download text when *the web* was there, with pictures and animated gifs and *just worked*? Old timers complaining about the [Eternal September](https://en.wikipedia.org/wiki/Eternal_September) could *keep it*.\n\nBlogs were the outposts of the Web's Own celebrities. The ritual of typing in URLs gave way to *News Aggregation* as platforms looked for things they could package; RSS was first prominent on Netscape's portal, as they looked for ways to stay relevant without having expensive Andressons to hire. And though they still fell, the protocol stood firm, before Google took the mantle and built RSS as a central service, like they had with email. It made sense; publishers were hit less, and subscriptions became social. We could follow each others' accounts. We had drifted from Net News meaning decentralised NNTP to centralised Google RSS.\n\nAnd just as things were looking good for RSS, Google pulled the plug. OPML was exported, but the social groups could not be. There were no good reasons; perhaps the act of finding and pasting an RSS URL was too far for Google's expected users to handle; perhaps it was not how they saw monetised online publishing to work as they became foundational online infrastructure. They left; others picked up the service and reimplemented much of it, but the damage was done. It was no longer free; and the still-cool Google showed they saw no future in it.\n\nAnd now, realising Net News covers clients that merge Maston, Fediverse, Bluesky, YouTube and Reddit as *information list* providers, there is not so much a technosemantic drift as a complete amnesiac rebirth. News is free of *Net*, a needless tautology when *everything* comes *over* the net, even if the net is delivery and not interconnectivity. I am intrigued enough to bring my OldReader export (exported earlier from Google Reader) over to new clients.\n\nBut how strange a throwback. RSS intrinsically only holds on to the last few items in a feed; and if the site it was fed from is abandoned or rearchitected, what was there is lost. My reawakened feed accentuates further mistakes of centralisation; third-party intermediaries that once made sense and looked forever now lie broken and failed; Yahoo Pipes' promise of simplifying online data and converting it into RSS (amongst other features) lies not just abandoned, but salted and salting its firmaments.\n\nAnd names. Names I have not seen for years; names of projects, whimsy and serious; names of *people*, some no longer with us, their URLs baked into OPML lists but bereft of content or appropriated by those who acquired their domains and accounts. News of upcoming Radio Programmes from 13 years ago. Announcements of extensions for programmes that no longer exist. Archives of Art collectives no longer operating. But amongst the cobwebs, the rust and sharp corners, there is still life; RSS outlived its hosts.\n\nAnd here, this little place, is one more place hanging on. Is it trying to relive what it did not realise in the past? Is there less to prove with fewer peers? Is it digital nostalgia, mediating my sensations as much as our memories and thought are mediated by OpenAI and what Google retains? What once felt pioneering and intimate now feels nostalgic, abandoned; if it is not the systems that have aged, perhaps it is the people and our connections, the brittleness of aged contacts exposed as people once internet celebrities fade back into the strangers they always were, before XML let them diarise in public.\n\nAnd yet, I *am* enjoying this; despite the creaks and distance, the intervening years of Facebook and Other People's Platforms make this feel real, unmediated, *raw*. My mistakes and my insights side by side. News, technoculturalsemantically drifted into something forgotten but more real than it has felt before; not hype, not sales, not features, but a thing for its own sake, liberated finally; personal for the producer, not the consumer.\n",
				"date_published": "2025-06-25T22:06:28+00:00",
				"url": "https://micro.davemee.com/2025/06/25/so-while-im-surprised-that/"
			},
			{
				"id": "http://davemee.micro.blog/2025/06/25/im-writing-about-the-eternal/",
				
				"content_html": "<p>I&rsquo;m writing about the Eternal September in my thesis; it makes sense as a still extant metaphor. However, some of my research warrens pointed me at still-operational public NNTP servers, and postings as <em>recent</em> as last year, which surprised me, as I was expecting far less vibrancy. I&rsquo;m a little intrigued by them now; there&rsquo;s a strange atmosphere to them, of old internet, textual internet, with a parasitic uuencoded parallel layer not meant for human readers. I saw Hogwasher and Usenapp as current apps for macOS which handle Usenet, as well as having an old copy of Unison I was reading `olduse.net' with. Visiting the site, they&rsquo;ve spawned a new replay of usenet, with a <em>45 year</em> delay on it. My god.</p>\n<p>Unison hasn&rsquo;t been updated for a while; I was surprised to see it was made by Panic, who have accepted it&rsquo;s existence as a reminder of gentler times and made it <a href=\"https://blog.panic.com/the-future-of-unison/\">free</a>, the kind of freedom granted by dismissal from a costcutting employer.</p>\n",
				"content_text": "I'm writing about the Eternal September in my thesis; it makes sense as a still extant metaphor. However, some of my research warrens pointed me at still-operational public NNTP servers, and postings as *recent* as last year, which surprised me, as I was expecting far less vibrancy. I'm a little intrigued by them now; there's a strange atmosphere to them, of old internet, textual internet, with a parasitic uuencoded parallel layer not meant for human readers. I saw Hogwasher and Usenapp as current apps for macOS which handle Usenet, as well as having an old copy of Unison I was reading `olduse.net' with. Visiting the site, they've spawned a new replay of usenet, with a *45 year* delay on it. My god.\n\nUnison hasn't been updated for a while; I was surprised to see it was made by Panic, who have accepted it's existence as a reminder of gentler times and made it [free](https://blog.panic.com/the-future-of-unison/), the kind of freedom granted by dismissal from a costcutting employer.\n",
				"date_published": "2025-06-25T20:26:32+00:00",
				"url": "https://micro.davemee.com/2025/06/25/im-writing-about-the-eternal/"
			},
			{
				"id": "http://davemee.micro.blog/2025/06/19/twine-as-captcha/",
				"title": "Twine as Captcha",
				"content_html": "<p>I have just created a short Twine game as the contact page for dvrk.space; it’s effectively a captcha, but requires human reading to follow the correct links in the game to get to an email address. As the data is embedded in a json payload, hopefully it should be safe from spiders. The game itself is a meditation on the web and spidering thereof, and how it has lead to its destruction. It also mocks the ambiguity of image-based captchas, while acting as a textual one instead.</p>\n",
				"content_text": "I have just created a short Twine game as the contact page for dvrk.space; it’s effectively a captcha, but requires human reading to follow the correct links in the game to get to an email address. As the data is embedded in a json payload, hopefully it should be safe from spiders. The game itself is a meditation on the web and spidering thereof, and how it has lead to its destruction. It also mocks the ambiguity of image-based captchas, while acting as a textual one instead. \n",
				"date_published": "2025-06-19T10:44:47+00:00",
				"url": "https://micro.davemee.com/2025/06/19/twine-as-captcha/"
			},
			{
				"id": "http://davemee.micro.blog/2025/06/07/httpsmicroblogbooks/",
				
				"content_html": "<!-- raw HTML omitted -->\n<p><a href=\"https://micro.blog/books/9781526455444\">micro.blog/books/978&hellip;</a></p>\n",
				"content_text": "<img src=\"https://cdn.micro.blog/books/9781526455444/cover.jpg\" align=\"left\" class=\"microblog_book\" style=\"max-width: 60px; margin-right: 20px; margin-top: 0px; padding-top: 0px;\">\n\n[micro.blog/books/978...](https://micro.blog/books/9781526455444)\n",
				"date_published": "2025-06-07T14:55:05+00:00",
				"url": "https://micro.davemee.com/2025/06/07/httpsmicroblogbooks/"
			}
	]
}
